import { useEffect, useState } from 'react';
import '../Certificate.css'
import html2pdf from 'html2pdf.js/dist/html2pdf.min';
import DocsService from '../../services/DocsService';
import { Link } from 'react-router-dom';
import { ContractResponse } from '../../models/response/ContractResponse';
import { FaDownload } from 'react-icons/fa';
import moment from 'moment';

//export function AnketaRu(certificat:CertResponse)  {
export function ContractKz() {
  // const [certid] = useState<number>(id);
  // const [certificat, setCertificat] = useState<CertResponse>();
  const [contractData, setContractData] = useState<ContractResponse>();

  useEffect(() => {
    DocsService.getContractDataKz().then((response) => {
      setContractData(response.data);
    });
  }, []);


  const generatePdf = () => {
    const report = document.getElementById('contract');
    var opt = {
      image: { type: 'jpeg', quality: 0.98 },
      html2canvas: { scale: 2.5 },
      filename: `Договор_Каз_${localStorage.getItem('currentApplicantFIO')}.pdf`,
      jsPDF: { orientation: 'landscape' },
      pagebreak: { after: ['#after'] }
    };
    html2pdf().set(opt).from(report).save()
  };
  // const data = JSON.parse(localStorage.getItem('data'));


  return (
    <><div id='documentNavbar'><Link to="/applicants"><button id="documentNavbarButton">Назад</button></Link> &nbsp;
      <button id="documentNavbarButton" onClick={generatePdf}>Скачать&nbsp;&nbsp;<FaDownload /></button></div>
      <div id="contractBackground">
        <div id="contract">
          <div id="contractPadding">
            <table id="contractTable">
              <tr id="contractTr">
                <td id="contractTd"><b style={{ marginLeft: '30%' }}>Білім беру қызметін көрсету туралы</b><br />
                  <b style={{ marginLeft: '32%' }}>№ ________________ келісімшарт</b><br />
                  <b>Астана қ.</b><br />
                  <b>«____» __________202__ ж.</b><br /><br />

                  <p><b>«Esil University»</b> мекемесі бұдан әрі «Университет» не «Білім беру ұйымы» (ҚР БҒМ Білім және ғылым саласындағы бақылау комитеті 2022 жылдың 1 сәуірінде білім беру қызметін жүргізу құқығына берген № KZ08LAA00032358 Мемлекеттік лицензиясы бар) атынан Жарғы негізінде әрекет ететін ректор Таубаев Аяпберген Алданаевич бірінші тараптан және бұдан әрі «Білім алушы» деп аталатын  <u>{contractData?.lastname} {contractData?.firstname} {contractData?.patronymic}</u>, ЖСН: {contractData?.iin}, жеке куәлік {moment(contractData?.id_date).format("DD.MM.YYYY")} {contractData?.id_dep}  №{contractData?.id_card}
                    &nbsp;екінші тараптан және/немесе бұдан әрі «Тапсырыс беруші» деп аталатын _________________________________________________________________________,
                    (жеке тұлғаның тегі, аты, әкесінің аты (болған жағдайда) немесе заңды тұлғаның атауы)
                    атынан _________________________________________________________________________ негізінде әрекет ететін
                    (құрылтай құжаттарының реквизиттері)
                    _________________________________________________________________________
                    (заңды тұлға басшысының немесе басқа уәкілетті тұлғаның тегі, аты, әкесінің аты (болған жағдайда) және лауазымы),
                    және мүдделі _________________________________________________________________________,
                    (тегі, аты, әкесінің аты)
                    үшінші тараптан, осы білім беру қызметін көрсету туралы келісімшартты (бұдан әрі – Келісімшарт) жасасты:
                    <br /><br />
                    <b style={{ marginLeft: '34%' }}>1. КЕЛІСІМШАРТТЫҢ МӘНІ</b><br />
                    1.1. Тапсырыс беруші мен Білім алушы оқуға тапсырып, оқу ақысын төлейді, ал Университет Білім алушы <b>{contractData?.lastname} {contractData?.firstname} {contractData?.patronymic}</b> үшін оқу процесін ұйымдастыру
                    бойынша және білім алушыға {contractData?.specialization_code} {contractData?.specialization} білім бағдарламасы бойынша Қазақстан Республикасының мемлекеттік жалпыға міндетті білім беру стандартына сай <u>{contractData?.study_form}</u>&nbsp; оқу бөлімінде Университеттің оқу жоспарына сәйкес білім беру қызметін алуға мүмкіндік жасауға және қорытынды аттестаттаудан өткеннен және көрсетілген қызметтерге толық ақы төленгеннен кейін тиісті біліктілік пен білімі туралы құжатты беруге міндетті болады.
                  </p>
                </td>
                <td id="contractTd">
                  1.2. Оқу мерзімі - <u>{contractData?.course_count} жыл</u>.
                  <br />1.3 Ағымдағы оқу жылының қабылдау нәтижелері бойынша Университеттің ішкі құжаттарымен бекітілген көрсеткішке сәйкес университет нақты пәндер бойынша оқитын студенттердің жеткілікті санының және/немесе нақты оқытушының, топ рентабельділігінің қажетті деңгейіне қол жеткізуінің қағидаттарына сәйкес академиялық ағымдар мен топтарды қалыптастырады.
                  <br />1.4. Осы Келісімшартқа қол қою арқылы «Жеке деректер және оларды қорғау туралы» Қазақстан Республикасының 2013 жылғы 21 мамырдағы № 94-V Заңына сәйкес Білім алушы Университетке және үшінші тұлғаларға сөзсіз келісім береді, яғни білім алушының жеке деректерін жинау, өңдеу, қорғау және трансшекаралық жолдау үшін заңға қайшы келмейтін жағдайлар немесе құқықтық қатынастар бойынша Университетпен қазір де, болашақта да байланысты тұлғалар, осы келісіммен реттелетін мақсаттар үшін және университетпен бұрыннан бар немесе болашақта туындайтын кез келген азаматтық және (немесе) өзге де құқықтық қатынастардың туындауына байланысты университеттің қарауы бойынша, жалпыға қолжетімді дереккөздерді қоса алғанда, Білім алушының мынадай дербес деректері, сондай-ақ оларда болашақта болатын өзгерістер және (немесе) электрондық, қағаз және (немесе) басқа да материалдық тасығыштарда жазылған толықтырулар, оның ішінде, бірақ олармен шектелмей:
                  <br />1) азаматтық-құқықтық және (немесе) өзге де құқықтық қатынастарды ресімдеу үшін, сондай-ақ оларды орындау процесінде өзара іс-қимылды жүзеге асыру үшін қажетті мәліметтер және көрсетілген мәліметтерді растайтын құжаттар: тегі, аты, әкесінің аты (бар болса); азаматтығы; ЖСН; жеке басын куәландыратын құжаттың деректері; туған күні мен деректері; мүгедектік тобы мен еңбек қызметіне шектеу дәрежесі бар болуы; әлеуметтік жеңілдіктер мен әлеуметтік мәртебе туралы деректер; әрекет қабілеттілігі туралы мәліметтер; портреттік сурет (фотосурет); жынысы; қолы; банк деректемелері; өмірбаяндық деректер; кез келген сауалнама деректері; жүргізуші куәлігінің деректері;
                  <br />2) байланыста болу үшін мәліметтер және көрсетілген мәліметтерді растайтын құжаттар: нақты тұрғылықты жері туралы деректер; тіркеу орнының мекенжайы туралы деректер; байланыс ақпараты (телефон нөмірлері, электрондық пошта мекенжайы және т.б.); ҚР аумағында болуының заңдылығын растайтын құжаттар;
                  <br />3) білімі туралы мәліметтер және көрсетілген мәліметтерді растайтын құжаттар: аяқталған және (немесе) аяқтайын деп жатқан деңгейдегі білімі туралы деректер (оның ішінде бастауыш; негізгі орта; орта білім (жалпы орта, техникалық және кәсіптік); орта білімнен кейінгі; жоғары;</td>
              </tr>
              <tr className='after'><td><br /><br /><br /><br /><br /><br /><br /></td></tr>
              <tr id="contractTr">
                <td id="contractTd">
                  жоғары оқу орнынан кейінгі); ғылыми дәрежесі, ғылыми атағы; тілдерді меңгеруі; біліктілікті арттыру және қайта даярлау туралы деректер;
                  <br />4) отбасы жағдайы туралы мәліметтер және көрсетілген мәліметтерді растайтын құжаттар: неке қию және (немесе) бұзу туралы мәліметтер; азаматтық хал актілерін тіркеу туралы өзге де мәліметтер; асырауындағы адамдардың және (немесе) отбасының өзге де мүшелерінің болуы және (немесе) болмауы туралы мәліметтер; туыстық дәрежесі; асырауындағы адамдардың және (немесе) отбасының өзге де мүшелерінің дербес деректері; Қамқоршылық туралы мәліметтер; отбасы мүшелерінің және асырауындағы адамдардың жұмыс немесе оқу орны;
                  <br />5) әскери міндеттілерді және әскери қызметке жарамды азаматтарды әскери есепке алу туралы мәліметтер және көрсетілген мәліметтерді растайтын құжаттар.
                  <br />Мен  {contractData?.lastname} {contractData?.firstname} {contractData?.patronymic},
                  оқу барысында үш күн Университетке тиісті растайтын құжаттарды ұсына отырып, менің (өзім туралы) дербес деректерімнің кез келген өзгерістері және (немесе) толықтырулары туралы университетке жазбаша хабарлауға міндеттенемін.
                  <br />Университет білім алушының дербес деректерін жинау, өңдеу және трансшекаралық жолдауды мынадай мақсаттар үшін (және ол мақсаттармен шектелмей) жүзеге асырады:
                  <br />1) Университеттің Қазақстан Республикасының заңнамасымен өзіне жүктелген құқықтар мен міндеттерді тиісінше орындауы үшін;
                  <br />2) университеттің ішкі бақылауы мен есебі үшін, сондай-ақ тиісті шарттар, келісімдер және т.б. бойынша білім алушылар мен университеттің өз міндеттемелерін тиісінше орындауын бақылау және растау үшін;
                  <br />3) университеттің құқықтарын сот және соттан тыс қорғау үшін: тиісті шарттар, келісімдер және т.б. бойынша міндеттемелер бұзылған жағдайда; даулар, оның ішінде үшінші тұлғалармен даулар туындаған жағдайда;
                  <br />4) ҚР заңнамасының талаптарына сәйкес бұқаралық ақпарат құралдарында және өзге де жалпыға қолжетімді дереккөздерде жариялау және жалпыға қолжетімді деректерді орналастыру үшін.
                  <br />Мен төмендегілерді растаймын:
                  <br />1) Осы келісім Университетпен жасалған барлық қатынастарға қолданылады, оның ішінде бұрыннан бар және (немесе) осы келісімді беру кезінде туындайтын және болашақта туындайтын кез келген басқа да қатынастарға қолданылады және оқу мерзімінің соңына дейін және (немесе) Университетпен жасасқан осы Келісімшарт не басқа келісім т.б. мерзімі аяқталғанша, ҚР заңнамасында Университетке жүктелген құқықтары мен міндеттерін орындауы үшін қажетті ҚР заңнамасында бекітілген мерзім ішінде жарамды болады;

                </td>
                <td id="contractTd">
                  2) Бұл келісім Университетке үшінші тұлғалардың жеке деректерге қол жеткізу шарттарын дербес анықтау; жеке деректерді жалпыға қолжетімді дереккөздерде тарату құқығын береді;
                  <br />3) Университеттен дербес деректерді жинау, өңдеу және трансшекаралық жолдау кезінде білім алушыны ол туралы хабардар ету талап етілмейді;
                  <br />3) Университеттен дербес деректерді жинау, өңдеу және трансшекаралық жолдау кезінде білім алушыны ол туралы хабардар ету талап етілмейді;
                  <br />4) бұл келісім үшінші тұлғаларға Университетте Білім алушының жеке деректерін жинауға, өңдеуге және трансшекаралық жолдауға қажетті өкілеттігі бар екенінің дәлелі бола алады;
                  <br />5) осы келісім Қазақстан Республикасының заңнамасымен реттелетін жағдайларда, осы келісімнің күші жойылған күнге дейін университетке жазбаша нысанда ресімделген тиісті өтініштің негізінде кері қайтарып алынуы мүмкін. Бұл ретте, заңға сәйкес, бұл келісімді қайтарып алу Заңға қайшы келетін жағдайларда немесе менің университет алдында орындалмаған міндеттемелерім болса, бұл келісімді қайтарып алуға болмайтынын білемін;
                  <br />6) Университетпен жасалған тиісті Келісімшарт (тар) немесе өзге де келісімдерде университеттің дербес деректерді ашық байланыс арналары арқылы беруін қарастыратындай жағдайда, мен деректерді үшінші тұлғалардың рұқсатсыз алу тәуекелін түсінемін және мұндай тәуекелді қабылдаймын;
                  <br />7) тегі, аты, әкесінің аты (бар болса), лауазымы, байланыс ақпараты (телефон нөмірлері, электрондық пошта мекенжайлары және т.б.), портреттік сурет (фотосурет) бар жеке деректер жалпыға қолжетімді, яғни ол деректерге еркін түрде қол жеткізуге болады;
                  <br />8) Университет Қазақстан Республикасының заңнамасында белгіленген жағдайларда білім алушының келісімінсіз дербес деректерді жинауға, өңдеуге және трансшекаралық беруге құқылы;
                  <br />9) университет заң талаптарын және (немесе) осы Келісімшартта көрсетілген шарттарды орындаған жағдайда, болашақта менің (өзім туралы) дербес деректерімді жинауға, өңдеуге және трансшекаралық жолдауға қатысты университетке ешқандай шағым болмайды.
                  <br />Мен (біз) осы Келісімшарттың мәтінімен таныстым(қ) және ешқандай толықтыру, ескерту немесе қарсылығым(ыз) жоқ.
                  <br />__________________________________________________________
                  <br />(ТАӘ, толық түрде қолмен жазылады)<br />
                  <br />_____________________________________
                  <br />(күні, қолы)

                </td>
              </tr>
              <tr className='after'><td><br /><br /><br /><br /><br /><br /><br /><br /></td></tr>
              <tr id="contractTr">
                <td id="contractTd">
                  <b style={{ marginLeft: '18%' }}>2. ТАРАПТАРДЫҢ ҚҰҚЫҚТАРЫ МЕН МІНДЕТТЕРІ</b>
                  <br /><b>2. 1. Университет:</b>
                  <br />2.1.1. Өткізілген конкурс нәтижелері бойынша (немесе басқа білім беру ұйымынан академиялық қарызын өтеу шартымен ауысу арқылы)  жылдық оқу ақысының ___ (_____________) %-ы мөлшерінде төлем жасаған жағдайда білім беру ұйымының білім алушылары қатарына {contractData?.lastname} {contractData?.firstname} {contractData?.patronymic} <u>{contractData?.specialization_code} {contractData?.specialization}</u>&nbsp; білім беру бағдарламасы бойынша оқуға қабылдауға;
                  <br />2.1.2. осы Келісімшартты жасасқан кезде Білім алушыны білім беру ұйымының Жарғысымен, білім беру қызметімен айналысу туралы лицензиямен, ішкі тәртіп ережелерімен және білім беру ұйымына қабылдау тәртібін реттейтін басқа да нормативтік құқықтық актілермен, сондай-ақ ұйымның  оқу-тәрбие процесін ұйымдастыру жөніндегі негізгі құжаттармен таныстыруға;
                  <br />2.1.3. білім алушыны Қазақстан Республикасының «Білім туралы» Заңының талаптарына сәйкес  оқытуды қамтамасыз етуге;
                  <br />2.1.4. білім алушының оқу жүктемесінің көлемін және қолданыстағы стандарттарға сәйкес үзілістермен бірге сабақ режимін айқындау, білім алушының білім алуына сау, қауіпсіз жағдай жасауға;
                  <br /> 2.1.5. білім беру ұйымдарының кітапханаларының ақпараттық ресурстарына, оқулықтарға, оқу-әдістемелік кешендерге және оқу-әдістемелік құралдарға емін-еркін қол жеткізуі мен пайдалалануын қамтамасыз етуге;
                  <br />2.1.6. Білім алушыға білім беру ұйымының басшысы бекіткен жекелеген ережелерде көзделген тәртіпке және шарттарға сай білім беру бағдарламалары шеңберіндегі тапсырмаларды орындау үшін компьютерлік техниканы пайдалану мүмкіндігін қамтамасыз етуге;
                  <br />2.1.7. Университеттің оқу жоспарына сәйкес Білім алушының кәсіптік практикадан өтуін ұйымдастыруға;
                  <br />2.1.8. Қазақстан Республикасы Білім және ғылым министрлігінің Нормативтік құқықтық актілерінде және академиялық нормативтік құқықтық актілерде белгіленген тәртіппен және Университеттің академиялық саясатына сай Білім алушының өтініші бойынша демалыс уақытында жазған өтініші негізінде бір білім беру бағдарламасынан екіншісіне немесе оқытудың бір нысанынан екіншісіне, сондай-ақ басқа білім беру ұйымына ауыстыруға, жазғы семестрде жеделдетілген бағдарлама бойынша оқытуды ұсынуға, оқудан шығару және білім алушылар қатарына қайта қабылдауға;
                  <br />2.1.9. шартты бұзған кезде білім алушы оқу тәртібін, білім беру ұйымының ішкі тәртіп қағидалары мен Жарғысын бұзған және қаржылай берешек болған, академиялық үлгермеген жағдайларды қоспағанда барлық оқу мерзіміне алдын ала ақы
                </td>
                <td id="contractTd">
                  төлеген жағдайда, төленген ақшасын ағымдағы оқу кезеңіндегі шығыстарды алып тастай отыра, оған бұйрық шыққан сәттен бастап қайтарып беруге;
                  <br />2.1.10. білім алушыны оның келісімісіз және оқу үдерісіне зиян тигізетін қоғамдық және басқа да тапсырмаларды орындауға тартуға жол бермеуге;
                  <br />2.1.11. білім алушыға білім беру ұйымының ғылыми, мәдени және спорттық іс-шараларына, сондай-ақ халықаралық ғылыми, мәдени және спорттық іс-шараларға ерікті түрде қатысуға мүмкіндік беруге;
                  <br />2.1.12. толық оқу курсын ойдағыдай аяқтаған соң, қорытынды аттестатаудан өту нәтижелері бойынша білім алушыға Бакалавр/Магистр біліктілігін (академиялық дәрежесін) беріп, мемлекеттік үлгідегі құжат табыстауға;
                  <br />2.1.13. оқу орны таратылған немесе білім беру қызметі тоқтатылған жағдайда білім алушыларды басқа білім беру ұйымына оқуын жалғастыру үшін ауыстыру жөнінде шаралар қабылдауға міндетті.
                  <b><br />2.2. Университет:</b>
                  <br />2.2.1. білім алушыдан осы Келісімшарт пен білім беру ұйымының ішкі тәртіп ережелеріне сәйкес міндеттерді адал және тиісті орындауды, сондай-ақ оқу тәртібін қадағалауды, білім беру ұйымының оқытушыларына, қызметкерлері мен білім алушыларына дұрыс әрі құрметпен қарауды талап етуге;
                  <br />2.2.2. оқу тәртібін, осы Келісімшарттың талаптарын, ішкі тәртіп ережелерін бұзғаны үшін білім алушыларға тәртіптік ықпал ету шараларын қолдануға;
                  <br />2.2.3. білім алушыдан білім беру ұйымының мүліктеріне ұқыпты қарауды, компьютерлік және басқа да техникалармен жұмыс істеу ережелерін қадағалауды талап етуге. Білім алушының әрекеттерінен материалдық залал келген жағдайда Қазақстан Республикасының қолданыстағы заңнамаларында қарастырылған тәртіппен оны қалпына келтіруге кеткен шығындардың орнын толтыруды талап етуге;
                  <br />2.2.4. оқудағы, ғылыми және шығармашылық қызметтердегі жетістіктері үшін білім алушыны ынталандыруды және марапаттауды жүзеге асыруға;
                  <br />2.2.5. оқуға төлем жасау тәртібіне қатысты айрықша жағдайларда жеке жеңілдіктер беруді қарастыруға;
                  <br />2.2.6. Келісімшартты  мынадай себептер бойынша: оқу тәртібін бұзғаны үшін, білім беру ұйымының ішкі тәртіп ережелері мен жарғысын бұзғаны үшін, шарттық міндеттемелерді орындамағаны үшін, басқа білім беру ұйымына ауысуына байланысты, қаржылық берешегі болғаны, академиялық үлгерімі жетпегені үшін, сондай-ақ Қазақстан Республикасының қолданыстағы заңнамасында көзделген өзге де жағдайларда біржақты тәртіппен бұзуға;
                  <br />2.2.7. Қазақстан Республикасының заңнамасында, осы Келісімшарттың талаптарында белгіленген тәртіппен қызметтердің құнын, төлем
                </td>
              </tr>
              <tr className='after'><td><br /><br /><br /><br /><br /></td></tr>
              <tr id="contractTr">
                <td id="contractTd">
                  шарттарын, қызметтердің тізбесін, түрлері мен құрамын, осы Келісімшарттың нысаны мен мазмұнын біржақты тәртіппен өзгертуге;
                  <br />2.2.8. білім беру үдерісінің сапасын бақылау, сондай-ақ заңға қайшы әрекеттердің алдын алу мақсатында университет аумағында бейне және аудио жазба бақылау жүргізіледі. Бейне және аудио материалдар қатаң шектеулі адамдар тобына ғана қолжетімді болады және оларды осы Келісімшартта көзделмеген мақсаттар үшін басқа адамдарға беруге болмайды.
                  <br />2.2.9. Білім алушылар өздері таңдап түскен білім беру бағдарламалары бойынша топ құру кезінде Келісімшарттың 1.3. тармағында қарастырылғандай топ құру үшін білім алушалар саны жеткіліксіз болған жағдайда Білім алушыларды Университеттің басқа білім алу бағдарламасы бойынша оқуға ауыстыру, болмаса өзі білім алып жатқан білім беру бағдарламасы бойынша басқа жоғары білім беру ұйымына ауыстыруға ықпал етуге.
                  <br />2.2.10. жеделдетілген оқыту нысанында білім алып жатқан Білім алушының академиялық қарызы болған жағдайда Білім алушының алдын ала келісімінсіз оны жалпы оқу мерзіміне ауыстыруға құқылы.
                  <b><br />2.3. Білім алушы:</b>
                  <br />2.3.1. пәндерді қашықтықтан оқыту технологияларын пайдалана отырып оқу кезінде өзінің білім алу үдерісін келесідей техникалық жағдайлармен өзі қамтамасыз етуге:
                  <br />1) мынадай техникалық сипаттамалары бар компьютер немесе мобильді құрылғы (смартфон/планшет) – Операциялық жүйе: Windows XP және одан жоғары; Android 4.1 және одан жоғары; iOS 10 және одан жоғары;
                  <br />2) интернетке қосылу жылдамдығы: мәтіндік және графикалық материалдармен жұмыс істеу үшін –  кемінде 528 Кбит/сек; видеолар мен вебинарларды қарау үшін – кемінде 3 Мбит/сек.;
                  <br />3) портал MS Internet Explorer 10 және одан жоғары, Mozilla Firefox 6.0.1 және одан жоғары, Opera 16.0, Google Chrome 62.0 және одан жоғары стандарттарға сәйкес келетін кез-келген веб-браузермен ашылады;
                  <br />4) видео мазмұнды көру үшін: Windows Media Player және тиісті кодектер;
                  <br />5) қосымша материалдарды көру үшін: Мұрағаттаушы (WinRAR, 7zip және т.б.); кеңсе жиынтығы (OpenOffice, MS Office немесе басқа);
                  <br />6) FLV форматындағы анимацияларды, видеоларды және презентацияларды көру үшін: Flash Player ActiveX; Adobe Acrobat Reader немесе Foxit Reader;
                  <br />2.3.2. мемлекеттік жалпыға міндетті білім беру стандарттарының толық көлеміндегі білімді, іскерліктерді және практикалық дағдыларды меңгеруге, оқу және практикалық сабақтарға қатысуға міндетті. Студенттің осы тармақты бұзуы оны немесе Тапсырыс берушіні шарт бойынша төлемнен босатуға негіз болмайды;
                  <br />2.3.3. сабақта болмаған жағдайда, білім беру ұйымында болмаған күннен бастап бір апта ішінде бұл туралы білім беру ұйымына жазбаша хабарлауға; отбасылық жағдайы мен байланыс деректері (тұрғылықты жері, телефоны, электрондық поштасы және т.б.) өзгерген жағдайда білім беру ұйымына хабарлауға;

                </td>
                <td id="contractTd">
                  2.3.4. білім алушы амбулаториялық немесе стационарлық емделуде болған кезде растайтын құжаттарын көрсету арқылы білім беру ұйымын хабардар етуге;
                  <br />2.3.5. білім беру ұйымы басшысының бұйрықтары мен өкімдерін, Жарғысын, ішкі тәртіп ережелерін және осы Келісімшарт талаптарын сақтауға және орындауға;
                  <br />2.3.6. білім беру ұйымының мүліктеріне ұқыпты қарауға және оны тиімді пайдалануға, оқу мен жатақханада тұру үшін қалыпты жағдай жасауға қатысуға;
                  <br />2.3.7. әскери есепке алу қағидаларын сақтауға;
                  <br />2.3.8. білім беру ұйымдарының оқытушыларына, қызметкерлеріне және білім алушыларына құрмет көрсетуге және олармен сыпайы қатынас жасауға;
                  <br />2.3.9. жоғары оқу орнын бітіргеннен кейін кемінде үш жыл ауылдық жерде орналасқан мемлекеттік білім беру ұйымдарында жұмыс істеуге.
                  <br />Бұл ереже ауыл квотасы шегінде оқуға түскен ауыл (село) жастары арасынан шыққан азаматтарға қолданылады;
                  <br />2.3.10. жоғары оқу орнын бітіргеннен кейін мемлекеттік білім беру ұйымдарында кемінде үш жыл жұмыс істеуге міндетті.
                  <br />Бұл ереже мемлекеттік білім беру тапсырысы негізінде білім беру бағдарламалары бойынша оқуға түскен азаматтарға қолданылады;
                  <br />2.3.11. жоғары оқу орнын бітіргеннен кейін оқу орнын бітірген өңірде кемінде үш жыл жұмыс істеуге міндетті.
                  <br />Бұл ереже білім беру бағдарламалары бойынша оқуға қабылдау квотасы шегінде қабылданған ауыл жастары арасынан шыққан азаматтарға қолданылады.
                  <br />2.3.12. Коронавирус және басқа да инфекциялардың таралуын болдырмауға байланысты шектеу іс-шаралары кезеңінде санитарлық-эпидемиологиялық режимнің талаптарын сақтауға міндетті.
                  <br /><b>2.4. Білім алушы:</b>
                  <br />2.4.1. білім беру саласындағы уәкілетті орган бекіткен тәртіпте білім беру ұйымы басшысының бұйрығы негізінде тек қана демалыс кезінде бір оқу нысанынан екіншісіне, бір білім беру ұйымынан екіншісіне, бір мамандықтан басқа мамандыққа, сондай-ақ ақылы оқудан мемлекеттік білім тапсырысы бойынша оқуға ауысуға;
                  <br />2.4.2. оқудың барлық кезеңі үшін алдын ала төлем жасауға;
                  <br />2.4.3. қосымша ақыға мемлекеттік стандарттан тыс қосымша білім беру қызметтерін алуға;
                  <br />2.4.4. кітапханалар мен оқу залдары базаларында оқулық, оқу-әдістемелік әдебиеттер қорына еркін қол жеткізіп, пайдалануға;
                  <br />2.4.5. студенттік өзін-өзі басқару органдарына қатысуға құқылы.
                  <br />2.5. Тапсырыс беруші (болған жағдайда):
                  <br />2.5.1. белгіленген мерзімде және мөлшерде көрсетілетін білім беру қызметтері үшін ақы төлеуге міндетті;
                  <br />2.6. Тапсырыс беруші (болған жағдайда):
                </td>
              </tr>
              <tr className='after'><td><br /><br /><br /><br /><br /></td></tr>
              <tr id="contractTr">
                <td id="contractTd">

                  2.6.1. Білім алушыдан осы Келісімшартқа сәйкес міндеттерін адал және тиісінше орындауын талап етуге құқылы.

                  <br /><b style={{ marginLeft: '8%' }}>3. БІЛІМ БЕРУ ҚЫЗМЕТІНЕ ТӨЛЕМНІҢ МӨЛШЕРІ МЕН ТӘРТІБІ</b>
                  <br />3.1. Кредиттің құны, оқу ақысының мөлшері, мерзімдері теңгемен белгіленеді және оны жыл сайын білім беру ұйымының басшысы бекітеді.
                  <br />3.2. Оқу жылының ақысы:
                  <br />3.2.1. егер оқу жылы ағымдағы жылдың қыркүйек айынан келесі жылдың маусым айына дейінгі кезең болып есептелсе, Келісімшарт жасасқан кезде оқу ақысы  (______________)__________________________________________________________ теңгені құрайды;
                  <br />3.2.2. егер оқу жылы ағымдағы жылдың қыркүйек айынан келесі жылдың шілде айына дейінгі кезең болып есептелсе (яғни жазғы семестрді қоса алғанда), Келісімшарт жасаған кезде оқу ақысы: (___________________)_____________________________________________________<br />_________________________________________________________) теңгені құрайды;
                  <br />3.3. Оқу ақысы Қазақстан Республикасының «Білім туралы» Заңына сәйкес және білім беру қызметтерінің шарттары мен құнын айтарлықтай өзгертетін, еңбек ақысын және инфляция индексін арттыратын нормативтік құқықтық актілер шығарылған жағдайда университет ректорының бұйрығымен өзгертілуі мүмкін, бірақ жылына бір реттен жиі емес. Бұл ретте Университет білім алушыны оқу ақысының өзгергені туралы, сондай-ақ қызметтер көрсету талаптарының және Шарттың басқа да талаптарының өзгергені туралы, оның ішінде қажет болған жағдайда Университет Келісімшартқа қосымша келісім жасаспай ақ мұндай ақпаратты интернет-ресурста www.esil.edu.kz сайтында жария қолжетімділікте орналастыру арқылы хабарлайды;
                  <br />3.4. Оқу ақысы Келісімшарттың реквизітінде көрсетілген университеттің шотына біржолғы немесе мынадай талаптарға сәйкес қолма-қол емес ақша аудару жолымен төленеді:
                  <br />3.4.1 университетке қабылданғанға дейін кемінде 30% (ағымдағы жылдың 25 тамызы), ағымдағы жылдың 1 желтоқсанына дейін-20%, ағымдағы жылдың 1 ақпанына дейін-20%, ағымдағы жылдың 1 сәуіріне дейін - 30% (1 курсқа түсушілер немесе басқа жоғары оқу орындарынан ауысатындар үшін, сондай-ақ 2-3 курс білім алушылар үшін);
                  <br />3.4.2 оқу жылы басталғанға дейін кемінде 50%, қысқы емтихан сессиясына дейін қалған бөлігі (бакалавриат пен магистратураның соңғы курсының білім алушылары үшін).

                </td>
                <td id="contractTd">
                  3.5. Егер Келісімшарт кез келген тараптың бастамасы бойынша бұзылса, қызметтер үшін төлемді есептеу оқудан шығу туралы бұйрық шыққан күннен бастап тоқтатылады.
                  <br />3.7. Білім алушы академиялық демалыстан шыққан немесе қайта қабылданған жағдайда оқу ақысы академиялық демалыстан шығу немесе қалпына келтіру туралы бұйрық шығарылған кездегі тәртіппен және мөлшерде төленеді.
                  <br />3.8. Оқуды өз бетінше тоқтатқан кезде, яғни білім алушы осы Келісімшартты орындаудан біржақты бас тартқан жағдайда, осы Келісімшарт оқудан шығару туралы бұйрық шығарылған күннен бастап бұзылған болып есептеледі. Оған дейін оқу ақысын төлеу бойынша шарттық міндеттемелер сақталады.
                  <br /><b style={{ marginLeft: '25%' }} >4. ТАРАПТАРДЫҢ ЖАУАПКЕРШІЛІГІ</b>
                  <br />4.1. Осы Келісімшартта көзделген өз міндеттемелерін орындамағаны үшін немесе тиісінше орындамағаны үшін тараптар Қазақстан Республикасы заңнамаларында белгіленген жауапкершіліктерді мойнына алады.
                  <br />4.2. Келісімшарт тоқтатылған жағдайда Тапсырыс беруші мен Білім алушының көрсетілген қызметтер үшін берешекті төлеу жөніндегі жауапкершілігі бірдей болады.
                  <br /><b style={{ marginLeft: '29%' }} >5. ДАУЛАРДЫ ШЕШУ ТӘРТІБІ</b>
                  <br />5.1. Осы шартты орындау үрдісіне туындаған келіспеушіліктер мен даулар, тікелей тараптардың өзара қолайлы шешімдерге келуі мақсатында шешіледі.
                  <br />5.2. Тараптар арасында келіссөздер, өзара қолайлы шешімдер жасау жолымен шешілмеген мәселелер Қазақстан Республикасының қолданыстағы заңнамаларына сәйкес шешіледі.
                  <br /><b style={{ marginLeft: '40%' }} >6. ФОРС-МАЖОР</b>
                  <br />6.1. Су тасқыны, өрт, басқа табиғи апаттар, соғыс немесе соғыс қимылдары сияқты форс-мажорлық жағдай кезінде, сондай-ақ саналы шектерде Тараптардың бақылауынан тәуелді болмайтын және Келісімшартты жасаудан кейін пайда болған басқа кез-келген жағдай кезінде Тараптардың жауапкершілігі басталмайды. Алайда, бұл ереже форс-мажорлық жағдайға ұшыраған Тарап дәлелдемелерді ұсынса және бұл туралы екінші Тарапты форс-мажорлық жағдай туындаған сәттен бастап үш күннен кешіктірмей хабардар еткен жағдайда ғана қолданылады.
                  <br />6.2. билік пен басқару органдарының Тараптардың тым болмаса біреуінің осы шарт міндеттемелерін орындауына мүмкіндік бермейтін актілерді қабылдауы да Тараптардың бақылауына тәуелді болмайтын жағдайлар ретінде саналады.
                  <br />6.3. Тараптардың міндеттемелерді орындауы форс-мажорлық жағдайлар мен олардың салдарынының әрекет ету мерзіміне сәйкестендіріле отырып ауыстырылады.
                </td>
              </tr>
              <tr className='after'><td><br /><br /><br /><br /><br /><br /><br /><br /></td></tr>
              <tr id="contractTr">
                <td id="contractTd">
                  <b style={{ marginLeft: '5%' }} >7. ШАРТТЫҢ ҚОЛДАНЫЛУ МЕРЗІМІ, ТАЛАПТАРЫН ӨЗГЕРТУ ЖӘНЕ ОНЫ БҰЗУ ТӘРТІБІ</b>
                  <br />7.1. Осы Келісімшарт Тараптар қол қойған күннен бастап күшіне енеді және ол толық орындалғанға дейін қолданылады. Жаңа Келісімшарт жасағанда жаңа келісімшарт жасаған кездегі шарттар қолданылады.
                  <br />7.2. Осы Келісімшарттың талаптары өзгертілуі және толықтырылуы мүмкін. Келісімшартта қарастырылған біржақты ретпен өзгертуге болатын жағдайларды қоспағанда Келісімшартқа енгізілген барлық өзгерістер, толықтырулар мен қосымшалар жазбаша түрде ресімделеді және оларға уәкілетті тұлғалар/Тараптардың өкілдері қол қойған күннен бастап күшіне енеді. Келісімшартқа тиісті түрде ресімделген өзгерістер, толықтырулар мен қосымшалар әрқашан Келісімшартпен қатар бірге жүреді.
                  <br />7.3. Тараптар арасындағы шарттық қатынастар білім беру ұйымы басшысының тиісті бұйрығы шыққан сәтте тоқтайды.
                  7.4. Осы Келісімшарт мемлекеттік немесе орыс тілінде бірдей заң күші бар екі данада жасалады, ал Тапсырыс беруші қатысқан жағдайда үш данада жасалады және Тараптардың әрқайсысына бір данадан беріледі.
                  <br /><b>Тараптардың заңды мекенжайлары мен банк реквизиттері:</b>
                  <br />
                  <br /><b>Университет</b>
                  <br />«Esil University» мекемесі
                  <br />010005, Астана қ., А. Жұбанов к., 7
                  <br />Тел.: +7 7172 725401
                  <br />БСН 000840001204
                  <br />КБе 18
                  <br />ТТК 861
                  <br />IBAN KZ70965F010001865582 Астана қ. «ForteBank» АҚ филиалы
                  <br />BIC IRTYKZKA
                  <br />Ректор ________ Таубаев А.А.<br />
                  <br /><b>Білім алушы</b>
                  <br /><u>{contractData?.lastname} {contractData?.firstname} {contractData?.patronymic}</u>
                  <br /><u>{moment(contractData?.id_date).format("DD.MM.YYYY")} {contractData?.id_dep} Жеке куәлік <u>№ {contractData?.id_card}</u> выдано </u>
                  <br />Білім алушының ЖСН: <u>{contractData?.iin}</u>
                  <br />Білім алушының мекенжайы: <u>{contractData?.living_address}</u>
                  <br />
                  <br />*Білім алушының қолы: ________________________________________________________________________


                </td>
                <td id="contractTd">
                  Тапсырыс беруші (болған жағдайда)
                  ________________________________________________________________________
                  (Тапсырыс берушінің атауы немесе тегі, аты, әкесінің аты (болған жағдайда))
                  Тапсырыс берушінің орналасқан жері немесе мекенжайы:______________________________________________________________
                  ________________________________________________________________________

                  <br />Тапсырыс берушінің БСН:_________________
                  <br />Тапсырыс берушінің есеп шоты (болған жағдайда): ________________________
                  <br />Тапсырыс берушінің қолы: ___________________________
                  <br />
                  <br />М.О. (заңды тұлға үшін)
                  <br />
                  <br />Университет Жарғысымен, ішкі тәртіп Ережелерімен, білім беру қызметін жүргізу құқығына берген лицензиясымен таныстым _______________________
                  <br />
                  <br /><b>*Ескерту:</b> Егер Білім алушы он сегіз жасқа, яғни кәмелет жасқа толмаған болса, онда ол осы Келісімшартқа тек ата-анасының немесе оларды алмастыратын адамдардың келісімімен ғана қол қоюға құқылы, олардың келісімі қол қою арқылы расталады;
                </td>
              </tr>

            </table>
          </div>
        </div>
      </div>
    </>
  )
}

